#+title: Release Notes for Sprint 27
#+options: date:nil toc:nil author:nil num:nil
#+todo: ANALYSIS IMPLEMENTATION TESTING | COMPLETED CANCELLED
#+tags: story(s) epic(e) task(t) note(n) spike(p)

* Release Notes

This file contains all stories that were closed during sprint 27.

** Development Stories Implemented

#+begin: clocktable :maxlevel 3 :scope subtree
Clock summary at [2013-05-27 Mon 03:01]

| Headline                                                | Time    |       |       |
|---------------------------------------------------------+---------+-------+-------|
| *Total time*                                            | *22:59* |       |       |
|---------------------------------------------------------+---------+-------+-------|
| Development Stories Implemented                         |         | 22:59 |       |
| COMPLETED Make inclusion lists in includer a model type |         |       |  0:15 |
| IMPLEMENTATION Clean up the SML to C++ transformer      |         |       | 22:44 |
#+end:

*** COMPLETED Make inclusion lists in includer a model type
    CLOSED: [2013-05-23 Thu 23:16]
    CLOCK: [2013-05-23 Thu 23:05]--[2013-05-23 Thu 23:20] =>  0:15

We created a class inlined in the header for no good reason. make it a
model type.

*** IMPLEMENTATION Clean up the SML to C++ transformer                :spike:

Continuing from previous iteration, see description in Sprint 26.

**** COMPLETED Create =file_info_factory=
     CLOSED: [2013-05-25 Sat 23:39]
     CLOCK: [2013-05-23 Thu 23:20]--[2013-05-24 Fri 00:35] =>  1:15
     CLOCK: [2013-05-23 Thu 22:00]--[2013-05-23 Thu 23:05] =>  1:05
     CLOCK: [2013-05-23 Thu 07:50]--[2013-05-23 Thu 08:15] =>  0:25
     CLOCK: [2013-05-22 Wed 18:27]--[2013-05-22 Wed 18:52] =>  0:25
     CLOCK: [2013-05-22 Wed 18:24]--[2013-05-22 Wed 18:27] =>  0:03
     CLOCK: [2013-05-22 Wed 18:09]--[2013-05-22 Wed 18:18] =>  0:09
     CLOCK: [2013-05-22 Wed 08:29]--[2013-05-22 Wed 08:40] =>  0:11
     CLOCK: [2013-05-22 Wed 07:54]--[2013-05-22 Wed 08:18] =>  0:24
     CLOCK: [2013-05-21 Tue 23:41]--[2013-05-21 Tue 23:53] =>  0:12
     CLOCK: [2013-05-21 Tue 23:22]--[2013-05-21 Tue 23:41] =>  0:19
     CLOCK: [2013-05-21 Tue 22:30]--[2013-05-21 Tue 23:22] =>  0:52
     CLOCK: [2013-05-21 Tue 18:10]--[2013-05-21 Tue 18:42] =>  0:32
     CLOCK: [2013-05-21 Tue 17:57]--[2013-05-21 Tue 18:04] =>  0:07
     CLOCK: [2013-05-21 Tue 08:30]--[2013-05-21 Tue 08:32] =>  0:02
     CLOCK: [2013-05-21 Tue 08:23]--[2013-05-21 Tue 08:26] =>  0:08
     CLOCK: [2013-05-21 Tue 07:56]--[2013-05-21 Tue 08:15] =>  0:19
     CLOCK: [2013-05-20 Mon 23:10]--[2013-05-20 Mon 23:20] =>  0:10
     CLOCK: [2013-05-20 Mon 22:54]--[2013-05-20 Mon 23:10] =>  0:16
     CLOCK: [2013-05-20 Mon 22:42]--[2013-05-20 Mon 22:54] =>  0:12
     CLOCK: [2013-05-20 Mon 22:22]--[2013-05-20 Mon 22:41] =>  0:19
     CLOCK: [2013-05-20 Mon 22:08]--[2013-05-20 Mon 22:21] =>  0:13
     CLOCK: [2013-05-20 Mon 21:24]--[2013-05-20 Mon 22:06] =>  0:42
     CLOCK: [2013-05-20 Mon 18:07]--[2013-05-20 Mon 18:42] =>  0:35
     CLOCK: [2013-05-20 Mon 18:01]--[2013-05-20 Mon 18:05] =>  0:04
     CLOCK: [2013-05-20 Mon 17:46]--[2013-05-20 Mon 17:53] =>  0:07
     CLOCK: [2013-05-20 Mon 08:29]--[2013-05-20 Mon 08:37] =>  0:08
     CLOCK: [2013-05-20 Mon 08:26]--[2013-05-20 Mon 08:28] =>  0:02
     CLOCK: [2013-05-20 Mon 07:53]--[2013-05-20 Mon 08:15] =>  0:22
     CLOCK: [2013-05-19 Sun 22:53]--[2013-05-20 Mon 00:04] =>  1:11

**** COMPLETED Plug =file_info_factory= into workflow
     CLOSED: [2013-05-26 Sun 20:02]
     CLOCK: [2013-05-26 Sun 19:02]--[2013-05-26 Sun 20:02] =>  1:00
     CLOCK: [2013-05-26 Sun 01:37]--[2013-05-26 Sun 03:33] =>  1:56
     CLOCK: [2013-05-26 Sun 01:27]--[2013-05-26 Sun 01:37] =>  0:10
     CLOCK: [2013-05-25 Sat 23:39]--[2013-05-26 Sun 01:27] =>  1:48
     CLOCK: [2013-05-25 Sat 22:29]--[2013-05-25 Sat 23:39] =>  1:10
     CLOCK: [2013-05-22 Wed 22:20]--[2013-05-22 Wed 22:56] =>  0:36

**** COMPLETED Create workflow tests and fix new code
     CLOSED: [2013-05-27 Mon 00:02]
     CLOCK: [2013-05-26 Sun 23:36]--[2013-05-26 Sun 23:58] =>  0:22
     CLOCK: [2013-05-26 Sun 23:05]--[2013-05-26 Sun 23:36] =>  0:31
     CLOCK: [2013-05-26 Sun 22:43]--[2013-05-26 Sun 23:05] =>  0:22
     CLOCK: [2013-05-26 Sun 22:10]--[2013-05-26 Sun 22:38] =>  0:28
     CLOCK: [2013-05-26 Sun 20:37]--[2013-05-26 Sun 20:48] =>  0:11
     CLOCK: [2013-05-26 Sun 20:17]--[2013-05-26 Sun 20:37] =>  0:20
     CLOCK: [2013-05-26 Sun 20:08]--[2013-05-26 Sun 20:16] =>  0:08
     CLOCK: [2013-05-26 Sun 20:02]--[2013-05-26 Sun 20:03] =>  0:01

**** COMPLETED Add support for inheritance in workflow
     CLOSED: [2013-05-27 Mon 01:17]
     CLOCK: [2013-05-27 Mon 01:02]--[2013-05-27 Mon 01:17] =>  0:15
     CLOCK: [2013-05-27 Mon 00:03]--[2013-05-27 Mon 01:01] =>  0:58

**** COMPLETED Add support for visitor
     CLOSED: [2013-05-27 Mon 03:00]
     CLOCK: [2013-05-27 Mon 01:17]--[2013-05-27 Mon 02:27] =>  1:10

**** COMPLETED Remove legacy transformer
     CLOSED: [2013-05-27 Mon 03:01]
     CLOCK: [2013-05-27 Mon 02:27]--[2013-05-27 Mon 03:01] =>  0:34
*** IMPLEMENTATION Move services into their own type                  :story:

Continuing from previous iteration, see description in Sprint 26.

**** IMPLEMENTATION Move all of the existing pod code to use new type

*** IMPLEMENTATION Use explicit casting for versioned to unversioned conversions :story:

Continuing from previous iteration, see description in Sprint 26.

*** IMPLEMENTATION Add =extract_key= function                         :story:

Continuing from previous iteration, see description in Sprint 26.

** Deprecated Development Stories
